# EDA and Visualisation

### Importing libraries

In [1]:
# Basic Libraries
import numpy as np
import pandas as pd
import seaborn as sb
import matplotlib.pyplot as plt
sb.set()

### Importing our cleaned data

In [26]:
cleaned = pd.read_csv("cleaned_data.csv")
duped = pd.read_csv("duped_data.csv")
cuisines = pd.read_csv("cuisines.csv", squeeze=True)

In [8]:
display(cleaned.head(2))
print("cleaned has {} rows".format(len(cleaned)))

,Unnamed: 0,id,name,street_address,price,cuisine,rating,latitude,longitude,price_mid,cuisine_cats
0,0,0,1-V:U,"The Outpost Hotel Sentosa, 10 Artillery Avenue...",$31 - $50,Asian Variety,3.5,1.252299,103.820211,40.5,[0]
1,1,1,10 At Claymore,"Pan Pacific Orchard, 10 Claymore Road Level 2",$51 - $80,Multi-Cuisine,4.0,1.307401,103.829904,65.5,[1]

cleaned has 2833 rows

In [9]:
display(duped.head(2))
print("duped has {} rows".format(len(duped)))

,Unnamed: 0,id,name,street_address,price,cuisine,rating,latitude,longitude,price_mid,cuisine_cat,duplicate
0,0,0,1-V:U,"The Outpost Hotel Sentosa, 10 Artillery Avenue...",$31 - $50,Asian Variety,3.5,1.252299,103.820211,40.5,0,0
1,1,1,10 At Claymore,"Pan Pacific Orchard, 10 Claymore Road Level 2",$51 - $80,Multi-Cuisine,4.0,1.307401,103.829904,65.5,1,0

duped has 3772 rows

`cleaned` is the dataset we produced in [Data Cleaning.ipynb](http://localhost:8888/notebooks/Desktop/SC1015-Project/Data%20Cleaning.ipynb)

`duped` is mostly identical in contents to `cleaned`, but with each row containing multiple cuisines turned into multiple rows, each with a single cuisine. `cuisine_cats` is thus renamed to `cuisine_cat`. The `duplicate` column tracks whether the current row belongs to such a restaurant.

In [37]:
display(cuisines.head(2))
print("There are {} cuisines identified.".format(len(cuisines)))

0    Asian Variety
1    Multi-Cuisine
Name: 0, dtype: object

There are 52 cuisines identified.

`cuisines` is a `Series` representing the cuisine categories. `cuisine_cats` and `cuisine_cat` use its indices.